straga/micropython-esp32-twai/src_can_v2/mod_can.c
/* The MIT License (MIT)
 *
 * Copyright (c) 2019 Musumeci Salvatore
 * Copyright (c) 2021 Ihor Nehrutsa
 * Copyright (c) 2022 Yuriy Makarov
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to deal
 * in the Software without restriction, including without limitation the rights
 * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in
 * all copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * THE SOFTWARE.
 */
// #include <string.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"

#include "mpconfigport.h"
#include "py/obj.h"
#include "py/objarray.h"
#include "py/binary.h"
#include "py/runtime.h"
#include "py/builtin.h"
#include "py/mphal.h"
#include "py/mperrno.h"
#include "mpconfigport.h"
#include "freertos/task.h"
#include "esp_idf_version.h"

#include "esp_err.h"
#include "esp_log.h"
#include "soc/soc_caps.h"
#include "soc/clk_tree_defs.h"
#include "soc/twai_periph.h"
#include "hal/twai_types.h"
#include "hal/twai_hal.h"
#include "driver/twai.h"
#include "esp_task.h"
#include "mod_can.h"

// Include for clock source definitions
#if CONFIG_IDF_TARGET_ESP32
    // Original ESP32 doesn't need additional clock source includes
#else
    // For ESP32-C3/S2/S3 etc, include clock definitions if available
    #if __has_include("hal/clk_tree_hal.h")
        #include "hal/clk_tree_hal.h"
    #endif
    #if __has_include("soc/clk_tree_defs.h")
        #include "soc/clk_tree_defs.h"
    #endif
#endif

// Fallback definitions for missing constants
#ifndef TWAI_CLK_SRC_DEFAULT
    // Define a fallback if TWAI_CLK_SRC_DEFAULT is not available
    #if defined(TWAI_CLK_SRC_APB)
        #define TWAI_CLK_SRC_DEFAULT TWAI_CLK_SRC_APB
    #elif defined(SOC_MOD_CLK_APB)
        #define TWAI_CLK_SRC_DEFAULT SOC_MOD_CLK_APB
    #else
        #define TWAI_CLK_SRC_DEFAULT 0
    #endif
#endif

#define debug_printf(...)  mp_printf(&mp_plat_print, __VA_ARGS__); mp_printf(&mp_plat_print, " | %d at %s\n", __LINE__, __FILE__);

// Default bitrate: 500kb
#define CAN_TASK_PRIORITY           (ESP_TASK_PRIO_MIN + 1)
#define CAN_TASK_STACK_SIZE         (1024)
#define CAN_DEFAULT_PRESCALER (8)
#define CAN_DEFAULT_SJW (3)
#define CAN_DEFAULT_BS1 (15)
#define CAN_DEFAULT_BS2 (4)
#define CAN_MAX_DATA_FRAME          (8)


// Добавьте перед строкой 472 (примерно)
extern BaseType_t xTaskCreatePinnedToCore(TaskFunction_t pxTaskCode,
    const char * const pcName,
    const uint32_t usStackDepth,
    void * const pvParameters,
    UBaseType_t uxPriority,
    TaskHandle_t * const pxCreatedTask,
    const BaseType_t xCoreID);

static const twai_filter_config_t f_config = TWAI_FILTER_CONFIG_ACCEPT_ALL();

// Universal timing configuration for all ESP32 variants
// Handles structure differences between ESP32 generations

// Universal function to get timing configuration for any ESP32 variant
static inline twai_timing_config_t get_timing_config(uint32_t bitrate) {
#if CONFIG_IDF_TARGET_ESP32
    // For original ESP32: use manual timing calculations based on 40MHz APB clock
    // Bitrate = XTAL_FREQ / (BRP * (1 + tseg_1 + tseg_2))
    switch (bitrate) {
        case 1000:    return (twai_timing_config_t){.brp = 2000, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}; // 1kbps
        case 5000:    return (twai_timing_config_t){.brp = 400, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false};  // 5kbps
        case 10000:   return (twai_timing_config_t){.brp = 200, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}; // 10kbps
        case 12500:   return (twai_timing_config_t){.brp = 160, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}; // 12.5kbps
        case 16000:   return (twai_timing_config_t){.brp = 125, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}; // 16kbps
        case 20000:   return (twai_timing_config_t){.brp = 100, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}; // 20kbps
        case 25000:   return (twai_timing_config_t){.brp = 80, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false};  // 25kbps
        case 50000:   return (twai_timing_config_t){.brp = 40, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}; // 50kbps
        case 100000:  return (twai_timing_config_t){.brp = 20, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}; // 100kbps
        case 125000:  return (twai_timing_config_t){.brp = 16, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}; // 125kbps
        case 250000:  return (twai_timing_config_t){.brp = 8, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false};  // 250kbps
        case 500000:  return (twai_timing_config_t){.brp = 4, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false};  // 500kbps
        case 800000:  return (twai_timing_config_t){.brp = 2, .tseg_1 = 23, .tseg_2 = 6, .sjw = 3, .triple_sampling = false}; // 800kbps
        case 1000000: return (twai_timing_config_t){.brp = 2, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}; // 1Mbps
        default:      return (twai_timing_config_t){.brp = 4, .tseg_1 = 15, .tseg_2 = 4, .sjw = 3, .triple_sampling = false}; // Default to 500k
    }
#else
    // For ESP32-C3/S2/S3: use ESP-IDF macros with proper compound literal syntax
    switch (bitrate) {
        case 1000:    { twai_timing_config_t timing = TWAI_TIMING_CONFIG_1KBITS(); return timing; }
        case 5000:    { twai_timing_config_t timing = TWAI_TIMING_CONFIG_5KBITS(); return timing; }
        case 10000:   { twai_timing_config_t timing = TWAI_TIMING_CONFIG_10KBITS(); return timing; }
        case 12500:   { twai_timing_config_t timing = TWAI_TIMING_CONFIG_12_5KBITS(); return timing; }
        case 16000:   { twai_timing_config_t timing = TWAI_TIMING_CONFIG_16KBITS(); return timing; }
        case 20000:   { twai_timing_config_t timing = TWAI_TIMING_CONFIG_20KBITS(); return timing; }
        case 25000:   { twai_timing_config_t timing = TWAI_TIMING_CONFIG_25KBITS(); return timing; }
        case 50000:   { twai_timing_config_t timing = TWAI_TIMING_CONFIG_50KBITS(); return timing; }
        case 100000:  { twai_timing_config_t timing = TWAI_TIMING_CONFIG_100KBITS(); return timing; }
        case 125000:  { twai_timing_config_t timing = TWAI_TIMING_CONFIG_125KBITS(); return timing; }
        case 250000:  { twai_timing_config_t timing = TWAI_TIMING_CONFIG_250KBITS(); return timing; }
        case 500000:  { twai_timing_config_t timing = TWAI_TIMING_CONFIG_500KBITS(); return timing; }
        case 800000:  { twai_timing_config_t timing = TWAI_TIMING_CONFIG_800KBITS(); return timing; }
        case 1000000: { twai_timing_config_t timing = TWAI_TIMING_CONFIG_1MBITS(); return timing; }
        default:      { twai_timing_config_t timing = TWAI_TIMING_CONFIG_500KBITS(); return timing; } // Default to 500k
    }
#endif
}

// singleton CAN device object
esp32_can_config_t can_config = {
    .general = TWAI_GENERAL_CONFIG_DEFAULT(GPIO_NUM_2, GPIO_NUM_4, TWAI_MODE_NORMAL),
    .filter = TWAI_FILTER_CONFIG_ACCEPT_ALL(),
    .timing = {0}, // Will be initialized properly during first use via get_timing_config()
    .initialized = false
};

static esp32_can_obj_t esp32_can_obj = {
    {&machine_can_type},
    .config = &can_config,
    .handle = NULL,
};

// INTERNAL Deinitialize can
void can_deinit(const esp32_can_obj_t *self) {
    if (self->handle) {
        check_esp_err(twai_stop_v2(self->handle));
        check_esp_err(twai_driver_uninstall_v2(self->handle));
    }
    if (self->irq_handler != NULL) {
        vTaskDelete(self->irq_handler);
    }
    self->config->initialized = false;
}

static void esp32_can_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind) {
    esp32_can_obj_t *self = MP_OBJ_TO_PTR(self_in);

    if (self->config->initialized) {
        qstr mode;
        switch (self->config->general.mode) {
            case TWAI_MODE_LISTEN_ONLY:
                mode = MP_QSTR_LISTEN;
                break;
            case TWAI_MODE_NO_ACK:
                mode = MP_QSTR_NO_ACK;
                break;
            case TWAI_MODE_NORMAL:
                mode = MP_QSTR_NORMAL;
                break;
            default:
                mode = MP_QSTR_UNKNOWN;
                break;
        }
        mp_printf(print, "CAN(tx=%u, rx=%u, bitrate=%u, mode=%q, loopback=%u, extframe=%u)",
            self->config->general.tx_io,
            self->config->general.rx_io,
            self->config->bitrate,
            mode,
            self->loopback,
            self->extframe);
    } else {
        mp_printf(print, "Device is not initialized");
    }
}

// INTERNAL FUNCTION FreeRTOS IRQ task
static void esp32_can_irq_task(void *self_in) {
    esp32_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    uint32_t alerts;

