straga/micropython-esp32-twai/src_can_v2/mod_can.c
    check_esp_err(twai_reconfigure_alerts_v2(self->handle, TWAI_ALERT_ALL,
        // TWAI_ALERT_RX_DATA | TWAI_ALERT_RX_QUEUE_FULL | TWAI_ALERT_BUS_OFF | TWAI_ALERT_ERR_PASS |
        // TWAI_ALERT_ABOVE_ERR_WARN | TWAI_ALERT_TX_FAILED | TWAI_ALERT_TX_SUCCESS | TWAI_ALERT_BUS_RECOVERED,
        // TWAI_ALERT_TX_IDLE | TWAI_ALERT_BELOW_ERR_WARN | TWAI_ALERT_ERR_ACTIVE | TWAI_ALERT_RECOVERY_IN_PROGRESS |
        // TWAI_ALERT_ARB_LOST | TWAI_ALERT_BUS_ERROR | TWAI_ALERT_RX_FIFO_OVERRUN | TWAI_ALERT_TX_RETRIED | TWAI_ALERT_PERIPH_RESET,
        NULL
        ));

    while (1) {
        check_esp_err(twai_read_alerts_v2(self->handle, &alerts, portMAX_DELAY));


        if (alerts & TWAI_ALERT_BUS_OFF) {
            for (int i = 3; i > 0; i--) {
                vTaskDelay(pdMS_TO_TICKS(1000));
            }
            twai_initiate_recovery_v2(self->handle); // Needs 128 occurrences of bus free signal
        }
        if (alerts & TWAI_ALERT_BUS_OFF) {
            ++self->num_bus_off;
        }
        if (alerts & TWAI_ALERT_ERR_PASS) {
            ++self->num_error_passive;
        }
        if (alerts & TWAI_ALERT_ABOVE_ERR_WARN) {
            ++self->num_error_warning;
        }
        if (alerts & (TWAI_ALERT_BUS_RECOVERED)) {
            self->bus_recovery_success = 1;
        }

        if (alerts & (TWAI_ALERT_TX_FAILED | TWAI_ALERT_TX_SUCCESS)) {
            self->last_tx_success = (alerts & TWAI_ALERT_TX_SUCCESS) > 0;
        }

        if (self->tx_callback != mp_const_none) {
            check_esp_err(twai_get_status_info_v2(self->handle, &self->status));
            if (alerts & TWAI_ALERT_TX_IDLE) {
                mp_sched_schedule(self->tx_callback, MP_OBJ_NEW_SMALL_INT(0));
            }
            if (alerts & TWAI_ALERT_TX_SUCCESS) {
                mp_sched_schedule(self->tx_callback, MP_OBJ_NEW_SMALL_INT(1));
            }
            if (alerts & TWAI_ALERT_TX_FAILED) {
                mp_sched_schedule(self->tx_callback, MP_OBJ_NEW_SMALL_INT(2));
            }
            if (alerts & TWAI_ALERT_TX_RETRIED) {
                mp_sched_schedule(self->tx_callback, MP_OBJ_NEW_SMALL_INT(3));
            }
        }

        if (self->rx_callback != mp_const_none) {
            if (alerts & TWAI_ALERT_RX_DATA) {
                check_esp_err(twai_get_status_info_v2(self->handle, &self->status));
                uint32_t msgs_to_rx = self->status.msgs_to_rx;

                if (msgs_to_rx == 1) {
                    // first message in queue
                    mp_sched_schedule(self->rx_callback, MP_OBJ_NEW_SMALL_INT(0));
                } else if (msgs_to_rx >= self->config->general.rx_queue_len) {
                    // queue is full
                    mp_sched_schedule(self->rx_callback, MP_OBJ_NEW_SMALL_INT(1));
                }
            }
            if (alerts & TWAI_ALERT_RX_QUEUE_FULL) {
                // queue overflow
                mp_sched_schedule(self->rx_callback, MP_OBJ_NEW_SMALL_INT(2));
            }
            if (alerts & TWAI_ALERT_RX_FIFO_OVERRUN) {
                mp_sched_schedule(self->rx_callback, MP_OBJ_NEW_SMALL_INT(3));
            }
        }
    }
}

static mp_obj_t esp32_can_init_helper(esp32_can_obj_t *self, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    enum { ARG_mode, ARG_prescaler, ARG_sjw, ARG_bs1, ARG_bs2, ARG_auto_restart, ARG_bitrate, ARG_extframe,
           ARG_tx_io, ARG_rx_io, ARG_clkout_io, ARG_bus_off_io, ARG_tx_queue, ARG_rx_queue};
    static const mp_arg_t allowed_args[] = {
        { MP_QSTR_mode, MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = TWAI_MODE_NORMAL} },
        { MP_QSTR_prescaler, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = CAN_DEFAULT_PRESCALER} },
        { MP_QSTR_sjw, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = CAN_DEFAULT_SJW} },
        { MP_QSTR_bs1, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = CAN_DEFAULT_BS1} },
        { MP_QSTR_bs2, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = CAN_DEFAULT_BS2} },
        { MP_QSTR_auto_restart, MP_ARG_BOOL, {.u_bool = false} },
        { MP_QSTR_bitrate, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = 500000} },
        { MP_QSTR_extframe, MP_ARG_BOOL, {.u_bool = false} },
        { MP_QSTR_tx, MP_ARG_INT, {.u_int = 4} },
        { MP_QSTR_rx, MP_ARG_INT, {.u_int = 5} },
        { MP_QSTR_clkout, MP_ARG_INT, {.u_int = TWAI_IO_UNUSED} },
        { MP_QSTR_bus_off, MP_ARG_INT, {.u_int = TWAI_IO_UNUSED} },
        { MP_QSTR_tx_queue, MP_ARG_INT, {.u_int = 1} },
        { MP_QSTR_rx_queue, MP_ARG_INT, {.u_int = 1} },
    };

    // parse args
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // Configure device
    // self->config->general.mode = args[ARG_mode].u_int & 0x0F;
    self->config->general.tx_io = args[ARG_tx_io].u_int;
    self->config->general.rx_io = args[ARG_rx_io].u_int;
    self->config->general.clkout_io = args[ARG_clkout_io].u_int;
    self->config->general.bus_off_io = args[ARG_bus_off_io].u_int;
    self->config->general.tx_queue_len = args[ARG_tx_queue].u_int;
    self->config->general.rx_queue_len = args[ARG_rx_queue].u_int;
    self->config->general.alerts_enabled = TWAI_ALERT_ALL;
    // TWAI_ALERT_AND_LOG || TWAI_ALERT_BELOW_ERR_WARN || TWAI_ALERT_ERR_ACTIVE || TWAI_ALERT_BUS_RECOVERED ||
    // TWAI_ALERT_ABOVE_ERR_WARN || TWAI_ALERT_BUS_ERROR || TWAI_ALERT_ERR_PASS || TWAI_ALERT_BUS_OFF;
    
    self->config->general.clkout_divider = 0;


    // Configure device
    self->loopback = ((args[ARG_mode].u_int & CAN_MODE_SILENT_LOOPBACK) > 0);

    // If loopback mode is set, use TWAI_MODE_NO_ACK as in the official example
    if (self->loopback) {
        self->config->general.mode = TWAI_MODE_NO_ACK;
    } else {
        self->config->general.mode = args[ARG_mode].u_int & 0x0F;
    }


    self->extframe = args[ARG_extframe].u_bool;
    if (args[ARG_auto_restart].u_bool) {
        mp_raise_NotImplementedError("Auto-restart not supported");
    }
    self->config->filter = f_config; // TWAI_FILTER_CONFIG_ACCEPT_ALL(); //

