straga/micropython-esp32-twai/src_can_v2/mod_can.c
    // clear errors
    self->num_error_warning = 0;
    self->num_error_passive = 0;
    self->num_bus_off = 0;

    // Calculate CAN nominal bit timing from bitrate if provided
    self->config->bitrate = args[ARG_bitrate].u_int;
    
    if (self->config->bitrate == 0) {
        // Manual configuration with custom parameters
        self->config->timing = (twai_timing_config_t) {
            .brp = args[ARG_prescaler].u_int,
            .sjw = args[ARG_sjw].u_int,
            .tseg_1 = args[ARG_bs1].u_int,
            .tseg_2 = args[ARG_bs2].u_int,
            .triple_sampling = false
        };
    } else {
        // Use universal timing configuration for all ESP32 variants
        self->config->timing = get_timing_config(self->config->bitrate);
    }

    // Always initialize singleton timing if not done yet (for first use)
    if (can_config.timing.brp == 0) {
        can_config.timing = get_timing_config(500000); // Default 500k timing for singleton
    }

    mp_printf(&mp_plat_print, "CAN: TIMING\n");
    mp_printf(&mp_plat_print, "CAN: timing brp=%lu\n", self->config->timing.brp);
    mp_printf(&mp_plat_print, "CAN: timing tseg_1=%u\n", self->config->timing.tseg_1);
    mp_printf(&mp_plat_print, "CAN: timing tseg_2=%u\n", self->config->timing.tseg_2);
    mp_printf(&mp_plat_print, "CAN: timing sjw=%u\n", self->config->timing.sjw);
    mp_printf(&mp_plat_print, "CAN: timing triple_sampling=%u\n", self->config->timing.triple_sampling);

    mp_printf(&mp_plat_print, "CAN: BRP_MIN=%u, BRP_MAX=%u\n", SOC_TWAI_BRP_MIN, SOC_TWAI_BRP_MAX);
    mp_printf(&mp_plat_print, "CAN: bitrate %lukb\n", self->config->bitrate);
    mp_printf(&mp_plat_print, "CAN: Mode %u\n", self->config->general.mode);

    mp_printf(&mp_plat_print, "CAN: Loopback flag %u\n", self->loopback);


    check_esp_err(twai_driver_install_v2(&self->config->general, &self->config->timing, &self->config->filter, &self->handle));
    check_esp_err(twai_start_v2(self->handle));
    if (xTaskCreatePinnedToCore(esp32_can_irq_task, "can_irq_task", CAN_TASK_STACK_SIZE, self, CAN_TASK_PRIORITY, (TaskHandle_t *)&self->irq_handler, MP_TASK_COREID) != pdPASS) {
        mp_raise_msg(&mp_type_RuntimeError, MP_ERROR_TEXT("failed to create can irq task handler"));
    }
    self->config->initialized = true;
    return mp_const_none;
}

// CAN(bus, ...) No argument to get the object
// If no arguments are provided, the initialized object will be returned
static mp_obj_t esp32_can_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    // check arguments
    mp_arg_check_num(n_args, n_kw, 1, MP_OBJ_FUN_ARGS_MAX, true);
    if (mp_obj_is_int(args[0]) != true) {
        mp_raise_TypeError("bus must be a number");
    }

    // work out port
    mp_uint_t can_idx = mp_obj_get_int(args[0]);
    if (can_idx > SOC_TWAI_CONTROLLER_NUM - 1) {
        mp_raise_msg_varg(&mp_type_ValueError, "out of CAN controllers:%d", SOC_TWAI_CONTROLLER_NUM);
    }

    esp32_can_obj_t *self = &esp32_can_obj;
    self->status.state = STOPPED;
    if (!self->config->initialized || n_args > 1 || n_kw > 0) {
        if (self->config->initialized) {
            // The caller is requesting a reconfiguration of the hardware
            // this can only be done if the hardware is in init mode
            can_deinit(self);
        }
        self->tx_callback = mp_const_none;
        self->rx_callback = mp_const_none;
        self->irq_handler = NULL;
        self->rx_state = RX_STATE_FIFO_EMPTY;

        if (n_args > 1 || n_kw > 0) {
            // start the peripheral
            mp_map_t kw_args;
            mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
            esp32_can_init_helper(self, n_args - 1, args + 1, &kw_args);
        }
    }
    return MP_OBJ_FROM_PTR(self);
}

// init(tx, rx, bitrate, mode=NORMAL, tx_queue=2, rx_queue=5)
static mp_obj_t esp32_can_init(size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args) {
    esp32_can_obj_t *self = MP_OBJ_TO_PTR(pos_args[0]);
    if (self->config->initialized) {
        mp_raise_msg(&mp_type_RuntimeError, "Device is already initialized");
        return mp_const_none;
    }
    return esp32_can_init_helper(self, n_args - 1, pos_args + 1, kw_args);
}
static MP_DEFINE_CONST_FUN_OBJ_KW(esp32_can_init_obj, 4, esp32_can_init);

// deinit()
static mp_obj_t esp32_can_deinit(const mp_obj_t self_in) {
    const esp32_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->config->initialized != true) {
        mp_raise_msg(&mp_type_RuntimeError, "Device is not initialized");
        return mp_const_none;
    }
    can_deinit(self);
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(esp32_can_deinit_obj, esp32_can_deinit);

// CAN.restart()
// Force a software restart of the controller, to allow transmission after a bus error
static mp_obj_t esp32_can_restart(mp_obj_t self_in) {
    esp32_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    check_esp_err(twai_get_status_info_v2(self->handle, &self->status));

    if (!self->config->initialized || self->status.state != TWAI_STATE_BUS_OFF) {
        return mp_const_none;
        // mp_raise_ValueError(NULL);
    }

    self->bus_recovery_success = -1;
    check_esp_err(twai_initiate_recovery_v2(self->handle));
    mp_hal_delay_ms(200); // FIXME: replace it with a smarter solution

    while (self->bus_recovery_success < 0) {
        MICROPY_EVENT_POLL_HOOK
    }

    if (self->bus_recovery_success) {
        check_esp_err(twai_start_v2(self->handle));
    } else {
        mp_raise_OSError(MP_EIO);
    }
    return mp_const_none;
}
static MP_DEFINE_CONST_FUN_OBJ_1(esp32_can_restart_obj, esp32_can_restart);

// Get the state of the controller
static mp_obj_t esp32_can_state(mp_obj_t self_in) {
    esp32_can_obj_t *self = MP_OBJ_TO_PTR(self_in);
    if (self->config->initialized) {
        check_esp_err(twai_get_status_info_v2(self->handle, &self->status));
    }
    return mp_obj_new_int(self->status.state);
}
static MP_DEFINE_CONST_FUN_OBJ_1(esp32_can_state_obj, esp32_can_state);

